In [2]:
print('Hello World!')

Hello World!

In [5]:
import pandas as pd

In [7]:
data = {
    'EmployeeID': [101, 102, 103],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Department': ['Finance', 'IT', 'Finance'],
    'Salary': [75000, 85000, 70000]
}

In [8]:
df = pd.DataFrame(data)

In [9]:
df.head()

   EmployeeID     Name Department  Salary
0         101    Alice    Finance   75000
1         102      Bob         IT   85000
2         103  Charlie    Finance   70000

In [10]:
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: str

In [12]:
df[df['Name']=='Bob']

   EmployeeID Name Department  Salary
1         102  Bob         IT   85000

In [15]:
df.sort_values('Salary', ascending=False)

   EmployeeID     Name Department  Salary
1         102      Bob         IT   85000
0         101    Alice    Finance   75000
2         103  Charlie    Finance   70000

In [16]:
df.groupby('Department')[["Salary"]].sum()

            Salary
Department
Finance     145000
IT           85000

In [17]:
9.0/3

3.0

In [19]:
'Hello' " World"

'Hello World'

In [22]:
a = 5
b = 10

print(bool(a is b))
print(a==b)

False
False

In [2]:
a = 'Om'
b = a
print(b == a)

True

In [3]:
print(b is a)
print(a is b)

True
True

In [4]:
b = 'Om'
print(a is b)
print(b is a)

True
True

for i in range(0,5):
    print(i)
    i+=2

In [5]:
print(1, 2, 3, 4, 5)

1 2 3 4 5